{"assignees":[],"author":{"id":"MDQ6VXNlcjIzMTIwODM3","is_bot":false,"login":"arpan-das-astrophysics","name":"Arpan Das"},"body":"**PROBLEM DESCRIPTION**\r\n\r\ncudF doesn't support applymap or applying using defined functions to columns containing list as cell values. Also, cudf can not save to_csv when dataframe has list columns. Both of these are supported in Pandas. However, switching back and forth between pandas and cudf is time-consuming for huge amount of datas, and it will be great if we can bring more support for list column dataframe\r\n\r\n**SOLUTION**\r\nI want to apply user defined functions to cudF columns with lists. The functions are not simple function with one arguement but more complex operation. Moreover I want to save cudf dataframe to csv or hdf5 without switching to pandas for the same type of dataframe.\r\n\r\n**Alternatives**\r\nOne alternative is to switch to pandas which is not ideal as I want to do everything in GPU. Another alternate solution I tried is by loading the list columns into numpy array and then apply the user defined function and then write them back to the dataframe which is again time-consuming. It will be way easier if I can just apply the function to the column directly.\r\n\r\n\r\n","closed":false,"closedAt":null,"comments":[{"id":"IC_kwDOBWUGps5EFnD2","author":{"login":"jrhemstad"},"authorAssociation":"CONTRIBUTOR","body":">  The functions are not simple function with one arguement but more complex operation.\r\n\r\nWhat kinds of operations do you have in mind?\r\n\r\nGeneric UDFs on lists are nearly impossible to parallelize as the user-defined function is effectively a black-box that would need to be executed serially across each list. Therefore, the amount of parallelism would be limited to just the number of lists and performance would be very poor on the GPU (it could easily be slower than the CPU).\r\n\r\nIt is a similar situation with strings, which is why we have numerous [built-in, optimized string functions](https://docs.rapids.ai/api/cudf/nightly/api_docs/string_handling.html). \r\n\r\nWe have some [built-in list functions](https://docs.rapids.ai/api/cudf/nightly/api_docs/series.html#list-handling) that are much better performing. You will have much better luck if you can find a way to express your problem in terms of these operations. There are many such operations implemented in the C++ layer that are not yet exposed to Python yet. So if there is functionality missing in these bulk functions, don't hesitate to ask as we may already have it and would just need to expose it to Python. ","createdAt":"2022-05-31T15:59:53Z","includesCreatedEdit":true,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/rapidsai/cudf/issues/11008#issuecomment-1142321398","viewerDidAuthor":false},{"id":"IC_kwDOBWUGps5HdCBY","author":{"login":"github-actions"},"authorAssociation":"NONE","body":"This issue has been labeled `inactive-30d` due to no recent activity in the past 30 days. Please close this issue if no further response or action is needed. Otherwise, please respond with a comment indicating any updates or changes to the original issue and/or confirm this issue still needs to be addressed. This issue will be labeled `inactive-90d` if there is no activity in the next 60 days.","createdAt":"2022-07-29T01:32:46Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/rapidsai/cudf/issues/11008#issuecomment-1198792792","viewerDidAuthor":false}],"createdAt":"2022-05-31T12:20:12Z","id":"I_kwDOBWUGps5Ku0SX","labels":[{"id":"MDU6TGFiZWw1OTk2MjY1NjE=","name":"feature request","description":"New feature or request","color":"a2eeef"},{"id":"MDU6TGFiZWwxMTM5NzQxMjEz","name":"cuDF (Python)","description":"Affects Python cuDF API.","color":"1d76db"}],"milestone":null,"number":11008,"projectCards":[{"project":{"name":"Feature Planning"},"column":{"name":"Needs prioritizing"}}],"projectItems":[],"reactionGroups":[],"state":"OPEN","title":"[FEA]Support for list columns","updatedAt":"2024-02-23T18:42:34Z","url":"https://github.com/rapidsai/cudf/issues/11008"}
