{"assignees":[],"author":{"id":"MDQ6VXNlcjE1MzgxNjU=","is_bot":false,"login":"vyasr","name":"Vyas Ramasubramani"},"body":"**Is your feature request related to a problem? Please describe.**\r\nlibcudf supports an empty type, `type_id::EMPTY`, that is analogous to [arrow's null type](https://arrow.apache.org/docs/format/Columnar.html#physical-memory-layout) used to represent a column of all null values. However, functionality for this type is only implemented in pieces and there are likely many cases where libcudf will fail if provided with such a column (#10761 is one somewhat recent example).\r\n\r\n**Describe the solution you'd like**\r\nWe should reevaluate the usage of `EMPTY` columns in libcudf, either removing them altogether or making them work more consistently across the code base. Removal seems like the simplest path forward, but there do appear to be some parts of cuIO that do leverage `EMPTY` columns, and there's an argument to be made that for conformance with the arrow spec we should maintain this type no matter what. If we keep it, we should make it easier to test APIs with such columns to ensure that they are handled appropriately. We also may need to improve handling of these columns in the higher-level APIs backed by libcudf such as cuDF Python or the Spark plugin.\r\n\r\n**Additional context**\r\nIt's worth noting that AFAICT a null column is trivial to optimize storage for since all that's needed is a size (both null mask and data are redundant). I don't think such columns are useful enough to spend much engineering effort on optimizations, though.","closed":false,"closedAt":null,"comments":[{"id":"IC_kwDOBWUGps5Rzm8T","author":{"login":"revans2"},"authorAssociation":"CONTRIBUTOR","body":"Spark also has a NullType, but it is not extensively used. It only shows up in cases where a null is explicitly put into the SQL with no type information at that point.  It is never used for any computation that I can see without casting it to a specific type first.  So like I said this is very minor and we are fine with out current solution where we store it as a INT8 that is null.","createdAt":"2023-01-05T17:03:01Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/rapidsai/cudf/issues/12477#issuecomment-1372483347","viewerDidAuthor":false}],"createdAt":"2023-01-05T00:54:29Z","id":"I_kwDOBWUGps5aloJh","labels":[{"id":"MDU6TGFiZWw1OTk2MjY1NjE=","name":"feature request","description":"New feature or request","color":"a2eeef"},{"id":"MDU6TGFiZWwxMDEzOTg3MzUy","name":"0 - Backlog","description":"In queue waiting for assignment","color":"d4c5f9"},{"id":"MDU6TGFiZWwxMTM5NzQwNjY2","name":"libcudf","description":"Affects libcudf (C++/CUDA) code.","color":"c5def5"}],"milestone":null,"number":12477,"projectCards":[{"project":{"name":"Feature Planning"},"column":{"name":"Needs prioritizing"}}],"projectItems":[],"reactionGroups":[],"state":"OPEN","title":"[FEA] Either improve support for or remove type_id::EMPTY","updatedAt":"2024-02-23T17:59:13Z","url":"https://github.com/rapidsai/cudf/issues/12477"}
