{"assignees":[],"author":{"id":"MDQ6VXNlcjE1MzgxNjU=","is_bot":false,"login":"vyasr","name":"Vyas Ramasubramani"},"body":"**Note for developers**\r\nThis is a meta-issue aiming to categorize a wide range of issues. Developers who want to tackle a specific item from the checklist below should create a new issue for just that item, self-assign that issue, and then link it to the checklist above.\r\n\r\n**Is your feature request related to a problem? Please describe.**\r\nThere are currently a number of different problems that make it difficult to find, add, or run tests.\r\n- Tests are partially and inconsistently organized by functionality, data types, and parametrizations, so it's not clear which file tests of a specific function might be in. The partial organization by dtype is particularly confusing because it means that in some files we test a single function across many dtypes, whereas in other files we test many functions for a single dtype.\r\n- Test files are too large and contain too many tests.\r\n- There are currently many tests that raise warnings as well as many xfailed tests that actually xpass.\r\n- Tests are currently slow to run because we rely on excessive parametrization and we test many private APIs. Additionally, cuIO tests are especially slow because the corresponding libcudf APIs are difficult to test, so a greater burden is placed on the Python APIs to capture a wider range of issues.\r\n\r\n**Describe the solution you'd like**\r\nThese are tasks that we propose to undertake to address the various issues discussed above:\r\n\r\n- [x] See #7386. Change pytest to run fail on xpasses by specifying the `strict` parameter. [Here are the relevant pytest docs](https://docs.pytest.org/en/latest/how-to/skipping.html#strict-parameter). \r\n- [x] Make pytest fail when it encounters warnings. We can accomplish this by setting in the appropriate config file (probably setup.cfg). (Done in #12468)\r\n  - [x] #10363\r\n  - [x] Remove other warnings from Python tests (this was done across a large number of PRs)\r\n- [ ] Reorganize test files to match the groupings in our API documentation. See also #4730\r\n- [ ] Reorganize tests into classes that reflect the actual class hierarchies. For example, tests that should be performed for Series and DataFrame objects can go into a `test_indexed_frame.py` file.\r\n- [ ] Reduce excessive parametrization. Many individual tests are actually run hundreds or even thousands of times because we construct a matrix of parameters. In many cases those parametrizations aren't actually testing anything useful, for instance when a test is parametrized by input size. In cases where we're worried about how the underlying libcudf algorithm behaves when block sizes are exceeded, for instance, we should push those tests down to C++. Python tests should favor fewer parameters and in some cases more specialized tests to handle specific edge cases.\r\n- [ ] Where appropriate, we should replace parametrization with fixtures. Fixtures will be typically evaluated lazily unlike parameters, which are materialized when the decorated functions are defined, so changing this should improve collection time and reduce the frequency with which we see failures during collection. Additionally, it makes it easier to debug failing tests when breakpoints are placed in the code; we don't want to hit breakpoints during collection. #2530 is related to this and may be resolved by addressing this task, but it's not quite as broad.\r\n- [ ] Remove tests of private functions/classes. If those functions/classes have corresponding public APIs, we need to make sure that those APIs are tested. If they are, then the tests of private code may be removed, otherwise those tests should be rewritten in terms of the corresponding public APIs.\r\n- [x] Stop using pd._testing (#6435)\r\n- [ ] #10001\r\n- [ ] Implement standard fixtures or use a similar approach to ensure consistent dtype coverage in tests. As part of this, decide what constitutes sufficient dtype coverage\r\n","closed":false,"closedAt":null,"comments":[{"id":"IC_kwDOBWUGps48EHiE","author":{"login":"bdice"},"authorAssociation":"CONTRIBUTOR","body":"I have started looking into `xfail_strict=true` in PR #9998. That will require some significant work to analyze all the `xfail` tests that pass (1956 tests failed with `xfail_strict=true`, and most of those are xpassed strict failures). I am going to prioritize solving locally failing tests like #7314 and reduce the number of warnings in the pytest log first, before going back to #9998.","createdAt":"2022-01-07T20:20:15Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/rapidsai/cudf/issues/9999#issuecomment-1007712388","viewerDidAuthor":false},{"id":"IC_kwDOBWUGps49cn53","author":{"login":"github-actions"},"authorAssociation":"NONE","body":"This issue has been labeled `inactive-30d` due to no recent activity in the past 30 days. Please close this issue if no further response or action is needed. Otherwise, please respond with a comment indicating any updates or changes to the original issue and/or confirm this issue still needs to be addressed. This issue will be labeled `inactive-90d` if there is no activity in the next 60 days.","createdAt":"2022-02-06T21:02:39Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/rapidsai/cudf/issues/9999#issuecomment-1030913655","viewerDidAuthor":false}],"createdAt":"2022-01-07T19:52:39Z","id":"I_kwDOBWUGps5BXR9l","labels":[{"id":"MDU6TGFiZWwxMDEzOTg3OTIx","name":"proposal","description":"Change current process or code","color":"2a2c89"},{"id":"MDU6TGFiZWwxMDE2MzQyNTY3","name":"tests","description":"Unit testing for project","color":"204ea3"},{"id":"MDU6TGFiZWwxMTM5NzQxMjEz","name":"cuDF (Python)","description":"Affects Python cuDF API.","color":"1d76db"},{"id":"MDU6TGFiZWwyNTQ2NTIxMDI0","name":"improvement","description":"Improvement / enhancement to an existing function","color":"bfd4f2"},{"id":"MDU6TGFiZWwyNTQ2NTIxMDY4","name":"non-breaking","description":"Non-breaking change","color":"0e8a16"}],"milestone":{"number":6,"title":"cuDF Python Refactoring","description":"Refactor Python layers to improve performance, robustness, and extensibility. Ongoing development is being guided by the roadmap and evolving development guide.","dueOn":null},"number":9999,"projectCards":[{"project":{"name":"Other Issues"},"column":{"name":"Needs prioritizing"}}],"projectItems":[],"reactionGroups":[],"state":"OPEN","title":"[FEA] Reorganize and improve Python tests","updatedAt":"2024-02-23T18:42:22Z","url":"https://github.com/rapidsai/cudf/issues/9999"}
