{"assignees":[],"author":{"id":"MDQ6VXNlcjM5NDM3NjE=","is_bot":false,"login":"bdice","name":"Bradley Dice"},"body":"This issue is a longer description for a project originally proposed here: https://github.com/rapidsai/cudf/issues/10432#issuecomment-1067560695\r\n\r\n## High-level overview\r\n\r\nSeveral features in libcudf are implemented using “aggregations”: operations that act on multiple pieces of data. Aggregations enable a wide range of computations, including scans over a column of data, reductions over a column to find quantiles or standard deviations, reductions over grouped data, rolling (windowed) averages, or segmented reductions that can find the minimum value of each list in a column. Real-world examples include computing a rolling average of sales through the year, or average sales grouped by the day of the week. Some aggregations are simple to implement (like a sum), while others require data pre-processing (like sum-of-squares, which squares each element before performing the sum across elements) or data post-processing (like a mean, which sums across elements and then divides by the number of elements). Currently, the code in libcudf implements a [visitor pattern](https://en.wikipedia.org/wiki/Visitor_pattern) for the groupby and rolling code paths using aggregation, but not for other paths such as reductions and segmented reductions.\r\n\r\n## Proposed changes\r\n\r\nThis issue proposes to:\r\n- implement the visitor pattern style of groupby/rolling for additional forms of aggregation such as reductions and segmented reductions\r\n- improve consistency and code reuse for aggregations across the library\r\n\r\nThe unified design should be benchmarked. Existing tests should be adapted to ensure complete coverage. Aggregation design documentation should be written for the libcudf developer docs so these patterns can be recognized and reused where appropriate.\r\n\r\nIdeally, we would like to use an _acyclic visitor pattern_ to reduce the amount of boilerplate code needed. References:\r\n- https://condor.depaul.edu/dmumaugh/OOT/Design-Principles/acv.pdf\r\n- https://codecrafter.blogspot.com/2012/12/the-acyclic-visitor-pattern.html\r\n\r\nSee also this table overview of [aggregation algorithms and operations](https://gist.github.com/codereport/b747c8cad4026fa1defc422411afbcbc).","closed":false,"closedAt":null,"comments":[{"id":"IC_kwDOBWUGps5GTBtq","author":{"login":"github-actions"},"authorAssociation":"NONE","body":"This issue has been labeled `inactive-30d` due to no recent activity in the past 30 days. Please close this issue if no further response or action is needed. Otherwise, please respond with a comment indicating any updates or changes to the original issue and/or confirm this issue still needs to be addressed. This issue will be labeled `inactive-90d` if there is no activity in the next 60 days.","createdAt":"2022-07-08T22:02:57Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/rapidsai/cudf/issues/11061#issuecomment-1179392874","viewerDidAuthor":false},{"id":"IC_kwDOBWUGps5LvgV-","author":{"login":"github-actions"},"authorAssociation":"NONE","body":"This issue has been labeled `inactive-90d` due to no recent activity in the past 90 days. Please close this issue if no further response or action is needed. Otherwise, please respond with a comment indicating any updates or changes to the original issue and/or confirm this issue still needs to be addressed.","createdAt":"2022-10-06T22:03:12Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/rapidsai/cudf/issues/11061#issuecomment-1270744446","viewerDidAuthor":false}],"createdAt":"2022-06-06T21:48:35Z","id":"I_kwDOBWUGps5LP64P","labels":[{"id":"MDU6TGFiZWw1OTk2MjY1NjE=","name":"feature request","description":"New feature or request","color":"a2eeef"},{"id":"MDU6TGFiZWwxMTM5NzQwNjY2","name":"libcudf","description":"Affects libcudf (C++/CUDA) code.","color":"c5def5"}],"milestone":{"number":28,"title":"Aggregations continuous improvement","description":"","dueOn":null},"number":11061,"projectCards":[{"project":{"name":"Feature Planning"},"column":{"name":"Needs prioritizing"}}],"projectItems":[],"reactionGroups":[{"content":"ROCKET","users":{"totalCount":2}}],"state":"OPEN","title":"Improve aggregations through an acyclic visitor pattern","updatedAt":"2023-07-22T20:31:37Z","url":"https://github.com/rapidsai/cudf/issues/11061"}
