{"assignees":[],"author":{"id":"MDQ6VXNlcjExMjY5ODE=","is_bot":false,"login":"wence-","name":"Lawrence Mitchell"},"body":"**Is your feature request related to a problem? Please describe.**\r\n\r\nTo match the way scan aggregation results in groupby operations are returned in pandas, libcudf returns scan-based aggregations in the same shape as the input table (these are then optionally reordered to mimic pandas order).\r\n\r\nFor the cudf-polars executor, it would be useful to also have a mode where the result of a scan aggregation is collected, group-wise, into a list column. This would mean that both scan-like and reduction-like groupby aggregations always produce an output table with a number of rows equal to the number of unique group keys.\r\n\r\n**Describe the solution you'd like**\r\n\r\nFor scan-only aggregations, this is relatively easy to achieve by taking the sorted grouped result and calling `make_lists_column` with the group offsets. When mixing scan and hash-based aggregations it is tricker (since those would spit things out in a different order and would then need a join). Ideally one the scan aggs have a \"collect as list\" option, then one would be able to do scan and reduce- aggs in the same call on the sorted table.\r\n\r\n**Describe alternatives you've considered**\r\n\r\nI can post-process the result (and then do a join if I have any hash-based aggs in addition).\r\n\r\n**Additional context**\r\n\r\nRight now, polars guarantees that although the order of groups in the result is implementation dependent, within a group, the rows show up in original dataframe order. I think this is also guaranteed by libcudf, since the sort-by-key before the aggregations is stable.\r\n","closed":false,"closedAt":null,"comments":[],"createdAt":"2024-04-16T11:18:38Z","id":"I_kwDOBWUGps6F2_w3","labels":[{"id":"MDU6TGFiZWw1OTk2MjY1NjE=","name":"feature request","description":"New feature or request","color":"a2eeef"},{"id":"MDU6TGFiZWwxMTM5NzQwNjY2","name":"libcudf","description":"Affects libcudf (C++/CUDA) code.","color":"c5def5"},{"id":"LA_kwDOBWUGps8AAAABlj4mkw","name":"cudf.polars","description":"Issues specific to cudf.polars","color":"0075ff"}],"milestone":null,"number":15541,"projectCards":[],"projectItems":[],"reactionGroups":[],"state":"OPEN","title":"[FEA] Allow groupby scan aggregations to return listified results","updatedAt":"2024-04-16T11:18:39Z","url":"https://github.com/rapidsai/cudf/issues/15541"}
