{"assignees":[],"author":{"id":"MDQ6VXNlcjc0MTY5MzU=","is_bot":false,"login":"ttnghia","name":"Nghia Truong"},"body":"Currently, there are a lot of template classes in cudf. They are mostly put in the header files (`.cuh`), and those headers are included in many other source files. As a result, compiling those source files will be very slow due to the implicit instantiation of template classes. In addition, whenever the template classes were changed, all the source files containing the headers containing those template classes will be recompiled, in a significant amount of time.\r\n\r\n**Solution:** Move the implementation of the template classes to separate source files whenever possible, and explicitly instantiate those template classes in their source files. By doing so:\r\n* The headers now only contain (template) class declaration, which can reduce much of compile time, and\r\n* The source files including those headers will not be recompiled when the template classes changed their implementation.\r\n\r\nClasses with template argument that is a cudf type can be refactored to apply this principle very easily. For classes that have template argument is an iterator, we can also separate their implementation and explicitly instantiate them with some common iterator types. For classes that have template argument is a functor, we can't do anything, unfortunately 😞 ","closed":false,"closedAt":null,"comments":[{"id":"IC_kwDOBWUGps45xqNm","author":{"login":"github-actions"},"authorAssociation":"NONE","body":"This issue has been labeled `inactive-90d` due to no recent activity in the past 90 days. Please close this issue if no further response or action is needed. Otherwise, please respond with a comment indicating any updates or changes to the original issue and/or confirm this issue still needs to be addressed.","createdAt":"2021-11-15T21:04:24Z","includesCreatedEdit":false,"isMinimized":false,"minimizedReason":"","reactionGroups":[],"url":"https://github.com/rapidsai/cudf/issues/8147#issuecomment-969319270","viewerDidAuthor":false}],"createdAt":"2021-05-03T21:33:47Z","id":"MDU6SXNzdWU4NzQ5Mjc4NzQ=","labels":[{"id":"MDU6TGFiZWw1OTk2MjY1NjE=","name":"feature request","description":"New feature or request","color":"a2eeef"},{"id":"MDU6TGFiZWwxMTM5NzQwNjY2","name":"libcudf","description":"Affects libcudf (C++/CUDA) code.","color":"c5def5"},{"id":"MDU6TGFiZWwyNTQ2NTIxMDI0","name":"improvement","description":"Improvement / enhancement to an existing function","color":"bfd4f2"}],"milestone":null,"number":8147,"projectCards":[{"project":{"name":"Feature Planning"},"column":{"name":"Needs prioritizing"}}],"projectItems":[],"reactionGroups":[],"state":"OPEN","title":"[FEA] Move template class implementation to source file where possible","updatedAt":"2024-02-23T17:59:27Z","url":"https://github.com/rapidsai/cudf/issues/8147"}
